Revit 2026 API

# VertexStreamPositionNormal Class

---

A stream that can be used to write vertices of type VertexPositionNormal into a buffer (see VertexBuffer).

SystemObject Autodesk.Revit.DB.DirectContext3DVertexStream Autodesk.Revit.DB.DirectContext3DVertexStreamPositionNormal

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexStreamPositionNormal : VertexStream
```
```vb
Public Class VertexStreamPositionNormal
	Inherits VertexStream
```
```cpp
public ref class VertexStreamPositionNormal : public VertexStream
```
```fsharp
type VertexStreamPositionNormal =
    class
        inherit VertexStream
    end
```

The VertexStreamPositionNormal type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from VertexStream) |

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionNormal into the stream and associated buffer. |
|  | AddVertices |  |
|  | Dispose | (Inherited from VertexStream) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace